//=============================================================================
//文件名称:
//功能概要:
//库版本：V3.5.0
//版权所有:源地工作室www.vcc-gnd.com
//版本更新:2013-02-20 v1.0
//调试方式:J-LINK-OB
//=============================================================================

//头文件
#include "display.h"
#include "OLED.h"
#include "rtc.h"
Clock_Type OldClock;
Clock_Type NewClock;


/*
*********************************************************************************************************
*	函 数 名: OLED_ConfigGPIO
*	功能说明: 配置OLED控制口线，设置为8位80XX总线控制模式或SPI模式
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void DateTimeReal_Display(void)
{
if(OldClock.Sec != NewClock.Sec)
{
	OldClock.Sec = NewClock.Sec;
	OLED_DisDigital(10, 45,OldClock.Sec, &tFont12);//显示整数
}
}






