//=============================================================================
//文件名称:ID.c 
//功能概要:获取stm32芯片ID，读取stm32Flash的容量
//库版本：V3.5.0
//版权所有:源地工作室http://vcc-gnd.taobao.com/
//版本更新:2015-02-20 v1.0
//调试方式:J-LINK-OB
//=============================================================================


//头文件
#include "Flash.h"
 u8 CpuId[12];          	//放置96位stm32的ID
 u16 STM32_FLASH_SIZE;	  //放置stm32flash的容量值
 
 
//=============================================================================
//函数名称:Get_Lock_ID
//功能概要:读取stm32的96位ID，并进行加密
//参数名称:无
//函数返回:无
//注意    :96位的ID是stm32唯一身份标识，可以以8bit、16bit、32bit读取
//=============================================================================
void Get_ID(void)
{
	u32 CpuId0,CpuId1,CpuId2;
	
		CpuId0=*(u32*)(0x1FFFF7E8);//产品唯一身份标识寄存器（96位）
		CpuId1=*(u32*)(0x1FFFF7EC);
		CpuId2=*(u32*)(0x1FFFF7F0);

		CpuId[0] = (u8)(CpuId0 & 0x000000FF);
		CpuId[1] = (u8)((CpuId0 & 0x0000FF00)>>8);
		CpuId[2] = (u8)((CpuId0 & 0x00FF0000)>>16);
		CpuId[3] = (u8)((CpuId0 & 0xFF000000)>>24);

		CpuId[4] = (u8)(CpuId1 & 0x000000FF);
		CpuId[5] = (u8)((CpuId1 & 0x0000FF00)>>8);
		CpuId[6] = (u8)((CpuId1 & 0x00FF0000)>>16);
		CpuId[7] = (u8)((CpuId1 & 0xFF000000)>>24);

		CpuId[8] = (u8)(CpuId2 & 0x000000FF);
		CpuId[9] = (u8)((CpuId2 & 0x0000FF00)>>8);
		CpuId[10]= (u8)((CpuId2 & 0x00FF0000)>>16);
		CpuId[11]= (u8)((CpuId2 & 0xFF000000)>>24);
}

//=============================================================================
//函数名称:Get_Flash_Size
//功能概要:读取stm32Flash的大小
//参数名称:无
//函数返回:无
//注意    :闪存容量寄存器基地址0x1FFFF7E0
//=============================================================================
void Get_Flash_Size(void)
{
	STM32_FLASH_SIZE=*(u16*)(0x1FFFF7E0); //闪存容量寄存器
}
